test/report/dot/moduleLevel/mocks/clusterless.dot
strict digraph "dependency-cruiser output"{
    
    
    

    "fs" [label="fs" color="grey" fontcolor="grey"]
    "http" [label="http" color="grey" fontcolor="grey"]
    subgraph "cluster_node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule" {label="somemodule" subgraph "cluster_node_modules/somemodule/node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule/node_modules/someothermodule" {label="someothermodule" "node_modules/somemodule/node_modules/someothermodule/main.js" [label="main.js" URL="node_modules/somemodule/node_modules/someothermodule/main.js" ] } } } }
    subgraph "cluster_node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule" {label="somemodule" subgraph "cluster_node_modules/somemodule/src" {label="src" "node_modules/somemodule/src/moar-javascript.js" [label="moar-javascript.js" URL="node_modules/somemodule/src/moar-javascript.js" ] } } }
    subgraph "cluster_node_modules" {label="node_modules" subgraph "cluster_node_modules/somemodule" {label="somemodule" subgraph "cluster_node_modules/somemodule/src" {label="src" "node_modules/somemodule/src/somemodule.js" [label="somemodule.js" URL="node_modules/somemodule/src/somemodule.js" ] } } }
    "one_only_one.js" [label="one_only_one.js" URL="one_only_one.js" ]
    "one_only_two.js" [label="one_only_two.js" URL="one_only_two.js" ]
    "path" [label="path" color="grey" fontcolor="grey"]
    "root_one.js" [label="root_one.js" URL="root_one.js" ]
    "root_two.js" [label="root_two.js" URL="root_two.js" ]
    "shared.js" [label="shared.js" color="red" fontcolor="red"]
    "somedata.json" [label="somedata.json" URL="somedata.json" fillcolor="#ffee44"]
    subgraph "cluster_sub" {label="sub" "sub/depindir.js" [label="depindir.js" URL="sub/depindir.js" ] }
    subgraph "cluster_sub" {label="sub" "sub/dir.js" [label="dir.js" URL="sub/dir.js" ] }
    "two_only_one.js" [label="two_only_one.js" URL="two_only_one.js" ]

    "node_modules/somemodule/src/somemodule.js" -> "node_modules/somemodule/src/moar-javascript.js" [xlabel="unnamed" tooltip="unnamed" ]
    "node_modules/somemodule/src/somemodule.js" -> "node_modules/somemodule/node_modules/someothermodule/main.js" [xlabel="unnamed" tooltip="unnamed" ]
    "one_only_one.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "one_only_two.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "one_only_one.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "one_only_two.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "shared.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "sub/dir.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "fs" [xlabel="unnamed" tooltip="unnamed" ]
    "root_one.js" -> "node_modules/somemodule/src/somemodule.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" -> "shared.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" -> "somedata.json" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" -> "two_only_one.js" [xlabel="unnamed" tooltip="unnamed" ]
    "root_two.js" -> "http" [xlabel="unnamed" tooltip="unnamed" ]
    "shared.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "sub/depindir.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "sub/dir.js" -> "sub/depindir.js" [xlabel="unnamed" tooltip="unnamed" ]
    "sub/dir.js" -> "path" [xlabel="unnamed" tooltip="unnamed" ]
    "two_only_one.js" -> "sub/dir.js" [xlabel="unnamed" tooltip="unnamed" ]
}
